artillery.get.yaml
config:
  target: 'http://localhost:3030'
  phases:
    - duration: 60
      arrivalRate: 1
      name: "10 request/sec"
    - duration: 60
      arrivalRate: 10
      name: "100 request/sec"
    - duration: 60
      arrivalRate: 100
      name: "1000 request/sec"
  processor: "./artillery-scripts.js"
  http:
    # Responses have to be sent within 10 seconds or the request will be aborted
    timeout: 10

scenarios:
  - flow:
      - loop:
        - function: "getRandomId"
        - get:
            url: "/product/pricing/{{ id }}"
        count: 10