artillery.get.yaml
config:
  target: 'http://localhost:3030'
  phases:
    - duration: 30
      arrivalRate: 1
      name: "1 request/sec"
    - duration: 30
      arrivalRate: 10
      name: "10 request/sec"
    - duration: 30
      arrivalRate: 100
      name: "100 request/sec"
    - duration: 90
      arrivalRate: 100
      rampTo: 900
      name: "Ramp up arrival rate from 100 - 1000"
    - duration: 30
      arrivalRate: 10
      name: "10 request/sec"
  processor: "./artillery-scripts.js"
  http:
    # Responses have to be sent within 5 seconds or the request will be aborted
    timeout: 10
  
scenarios:
  - flow:
    - function: "getRandomId"
    - get:
        url: "/product/pricing/{{ id }}"