artillery.get.yaml
config:
  target: 'http://localhost:3300'
  phases:
    - duration: 30
      arrivalRate: 1
      name: "1 request/sec"
    - duration: 60
      arrivalRate: 10
      name: "10 request/sec"
    - duration: 30
      arrivalRate: 100
      name: "100 request/sec"
    - duration: 100
      arrivalRate: 10
      rampTo: 1000
      name: "Ramp up arrival rate from 10 - 1000"
    - duration: 40
      arrivalRate: 10
      name: "10 request/sec"
  http:
    # Responses have to be sent within 5 seconds or the request will be aborted
    timeout: 5
  variables:
    id:
      - "1006010"
      - "4812435"
      - "7046552"
      - "9433691"
      - "11902399"
scenarios:
  - flow:
    - get:
        url: "/product/pricing/{{ id }}"